FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/БТ_КонстантныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_КонстантныеЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/верс_ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>верс_ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСжато</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВерсииОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.верс_ТипыВерсийОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПроигнорирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелРИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Comment>Права берутся от другого пользователя, указанного в этом реквизите</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияОборудования</Name>
					<Comment>0 - обычный режим, 1 - локальное оборудование недоступно для других, 2 - запрещено любое использование оборудования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШаблоном</Name>
					<Comment>Является шаблоном</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольККМ</Name>
					<Comment>пароль-идентификатор кассира при работе с КММ(ФР)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФункциональнойПанели</Name>
					<Comment>Настройка функциональной панели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФункциональнойПанели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинНаМобильномУстройстве</Name>
					<Comment>Логин на мобильном устройстве</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольНаМобильномУстройстве</Name>
					<Comment>Пароль на мобильном устройстве</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиАРМОтчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиАРМОтчеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/БТ_ПроцедурыДокументовСервер/Ext/Module.bsl
//<< Антон 13012022
//Формирование СФ на основании Реализации товаров, реализации Автомобилей и ЗН
Процедура СформироватьсчетФактура(Знач ДокументОбъект) Экспорт

	Если Ложь Тогда
		ДокументОбъект = Документы.РеализацияТоваров.СоздатьДокумент();	
	КонецЕсли;
	
	Если не РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("АвтоформированиеСчетФактур") = Истина 
		Или ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваров") 
			и (не ДокументОбъект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров)
		или ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказНаряд") 
			и (не ДокументОбъект.ВидРемонта.ФормироватьСчетФактурыАвтоматически 
			или не ДокументОбъект.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт)
		//или СФУжеЕстьВБазе(ДокументОбъект.Ссылка) //ЧалапАю БизТех 14.01.2025 
		Тогда
		
		Возврат;
		
	КонецЕсли;             
	
	ДокументОбъект.Движения.Записать();       
	
	//<<ЧалапАю БизТех 14.01.2025
	ДокСФ = БТ_ПроцедурыДокументовСервер.ВернутьСФ(ДокументОбъект.Ссылка);
	Если ДокСФ <> Неопределено Тогда 
		ДокСФОбъект = ДокСФ.ПолучитьОбъект();  
		Если ДокументОбъект.Проведен Тогда  
			ДокСФОбъект.Заполнить(ДокументОбъект.Ссылка);	
		КонецЕсли;
		ДокСФОбъект.Проведен = ?(не ДокументОбъект.Проведен, Ложь, ДокументОбъект.Проведен);
		ДокСФОбъект.ПометкаУдаления = ДокументОбъект.ПометкаУдаления;      
		Если ДокументОбъект.Проведен Тогда  
			ДокСФОбъект.Записать(РежимЗаписиДокумента.Проведение);
		иначе
			ДокСФОбъект.Записать(); 
		КонецЕсли;
	//ЧалапАю БизТех 14.01.2025	 >>
	иначе
		СчетФактураВыданная = Документы.СчетФактураВыданный.СоздатьДокумент();
		СчетФактураВыданная.Дата = ДокументОбъект.Дата + 1;     
		СчетФактураВыданная.УстановитьНовыйНомер();       
		СчетФактураВыданная.Заполнить(ДокументОбъект.Ссылка);        
		СчетФактураВыданная.Комментарий = "Сформирована автоматически";  
		Если НЕ СокрЛП(ДокументОбъект.Организация.ИНН) = "2311372580" Тогда //БизТех Аляль 16.07.2025г. не сформировались сф по Селекту
			Если (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваров") или ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияАвтомобилей")) 
				и СчетФактураВыданная.Товары.Итог("СуммаНДС") = 0  Тогда  			
				Возврат;
				
			КонецЕсли; 
		КонецЕсли;
		СчетФактураВыданная.Записать(РежимЗаписиДокумента.Проведение);   
		Сообщить(СтрШаблон("Сформирован документ: %1", СчетФактураВыданная.Ссылка));
	КонецЕсли;
КонецПроцедуры   

Функция СФУжеЕстьВБазе(ДокументОснование) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СчетФактураВыданный.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
		|	И СчетФактураВыданный.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Возврат не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ВернутьСФ(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;   
	//<<ЧалапАЮ БизТех 14.01.2025
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	СчетФактураВыданный.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//	|ГДЕ
	//	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";     
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.ПометкаУдаления КАК ПометкаУдаления,
	|	СчетФактураВыданный.Проведен КАК Проведен
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактураВыданный.Дата УБЫВ,
	|	СчетФактураВыданный.Номер УБЫВ";    
	//ЧалапАЮ БизТех 14.01.2025>>	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование.Ссылка);
	Если не Запрос.Выполнить().Пустой() Тогда
		Возврат Запрос.Выполнить().Выгрузить()[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	//Возврат не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ФормированиеСчетФактурыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт    
	Если не Отказ 
		и КонтрагентаНетВИсключенияхКумКаржи(Источник.Организация,Источник.Контрагент)   //ЧалапАю БизТех 27.01.2025
		Тогда
			СформироватьсчетФактура(Источник);
	КонецЕсли;
КонецПроцедуры

Функция КонтрагентаНетВИсключенияхКумКаржи(Организация,Контрагенты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БТ_КонтрагентыИсключенияПриФормированииКуммаржи.Контрагенты КАК Контрагенты
	|ИЗ
	|	РегистрСведений.БТ_КонтрагентыИсключенияПриФормированииКуммаржи КАК БТ_КонтрагентыИсключенияПриФормированииКуммаржи
	|ГДЕ
	|	БТ_КонтрагентыИсключенияПриФормированииКуммаржи.Контрагенты = &Контрагенты
	|	И БТ_КонтрагентыИсключенияПриФормированииКуммаржи.Организация = &Организация";
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();

КонецФункции

//ЧалапАю БизТех 25.07.2024
Процедура ОпределениеСегментацииКлиентов(Знач СтруктураПараметров) Экспорт
	Обработки.БТ_ОпределениеСегментацииКлиентовМЛК.Создать().Сформировать();
КонецПроцедуры	

//ЧалапАю БизТех 06.09.2024
Процедура БТ_ЗаполнениеДанныхСЧФ() экспорт
	ЗапросПостАМ = Новый Запрос("ВЫБРАТЬ
	                            |	ПоступлениеАвтомобилей.Ссылка КАК Ссылка
	                            |ИЗ
	                            |	Документ.ПоступлениеАвтомобилей КАК ПоступлениеАвтомобилей
	                            |ГДЕ
	                            |	ПоступлениеАвтомобилей.Проведен
	                            |	И ПоступлениеАвтомобилей.Дата МЕЖДУ &ДатаС И &ДатаПо");
	
	ЗапросПостАМ.УстановитьПараметр("ДатаС", НачалоДня(ТекущаяДата()-2*24*60*60));
	ЗапросПостАМ.УстановитьПараметр("ДатаПо", КонецДня(ТекущаяДата()));
	Результат = ЗапросПостАМ.Выполнить().Выгрузить();
	
	Для каждого СтрПоступление из Результат цикл
		ЗапросСФ = Новый Запрос("ВЫБРАТЬ
		|	СчетФактураПолученный.Ссылка КАК Ссылка,
		|	СчетФактураПолученный.Номер КАК Номер,
		|	СчетФактураПолученный.Дата КАК Дата,
		|	"""" КАК Статус,
		|	СчетФактураПолученный.ВхДокНомер КАК ВхДокНомер,
		|	СчетФактураПолученный.ВхДокДата КАК ВхДокДата
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ДокументОснование = &Ссылка");
		
		ЗапросСФ.УстановитьПараметр("Ссылка", СтрПоступление.Ссылка);
		РезультатСФ = ЗапросСФ.Выполнить().Выгрузить();
		
		Об = СтрПоступление.Ссылка.ПолучитьОбъект();

		Если РезультатСФ.Количество() <> 0 Тогда	
			Об.БТ_НомерСЧФ=Строка(РезультатСФ[0].ВхДокНомер);
			Об.БТ_ДатаСЧФ=РезультатСФ[0].ВхДокДата;
			Если СтрПоступление.Ссылка.Автомобили.найти(Справочники.СтавкиНДС.ОсновнаяСтавкаНДС,"СтавкаНДС")<> Неопределено тогда
				Об.БТ_СтатусСЧФ = Строка("Проведен"); 
			КонецЕсли;  
		иначе  //если счф не найдена
			Если СтрПоступление.Ссылка.Автомобили.найти(Справочники.СтавкиНДС.ОсновнаяСтавкаНДС,"СтавкаНДС")= Неопределено тогда    //без ндс
				Об.БТ_СтатусСЧФ = Строка("Не требуется");  
			иначе
				Об.БТ_СтатусСЧФ= Строка("Нет счет-фактуры");
			КонецЕсли;
		КОнецЕсли;
		Об.БТ_СуммаНДС = Строка(СтрПоступление.Ссылка.Автомобили.Итог("СуммаНДС"));  
		Об.Записать();
	КонецЦикла;

	ЗапросПостАМ = Новый Запрос("ВЫБРАТЬ
	                            |	ПоступлениеТоваров.Ссылка КАК Ссылка
	                            |ИЗ
	                            |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	                            |ГДЕ
	                            |	ПоступлениеТоваров.Проведен
	                            |	И ПоступлениеТоваров.Дата МЕЖДУ &ДатаС И &ДатаПо");
	
	ЗапросПостАМ.УстановитьПараметр("ДатаС", НачалоДня(ТекущаяДата()-2*24*60*60));
	ЗапросПостАМ.УстановитьПараметр("ДатаПо", КонецДня(ТекущаяДата()));
	Результат = ЗапросПостАМ.Выполнить().Выгрузить();
	
	Для каждого СтрПоступление из Результат цикл
		ЗапросСФ = Новый Запрос("ВЫБРАТЬ
		|	СчетФактураПолученный.Ссылка КАК Ссылка,
		|	СчетФактураПолученный.Номер КАК Номер,
		|	СчетФактураПолученный.Дата КАК Дата,
		|	"""" КАК Статус,
		|	СчетФактураПолученный.ВхДокНомер КАК ВхДокНомер,
		|	СчетФактураПолученный.ВхДокДата КАК ВхДокДата
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ДокументОснование = &Ссылка");
		
		ЗапросСФ.УстановитьПараметр("Ссылка", СтрПоступление.Ссылка);
		РезультатСФ = ЗапросСФ.Выполнить().Выгрузить();
		
		Об = СтрПоступление.Ссылка.ПолучитьОбъект();

		Если РезультатСФ.Количество() <> 0 Тогда	
			Об.БТ_НомерСЧФ=Строка(РезультатСФ[0].ВхДокНомер);
			Об.БТ_ДатаСЧФ=РезультатСФ[0].ВхДокДата;
			Если СтрПоступление.Ссылка.Товары.найти(Справочники.СтавкиНДС.ОсновнаяСтавкаНДС,"СтавкаНДС")<> Неопределено тогда
				Об.БТ_СтатусСЧФ = Строка("Проведен"); 
			КонецЕсли;  
		иначе  //если счф не найдена
			Если СтрПоступление.Ссылка.Товары.найти(Справочники.СтавкиНДС.ОсновнаяСтавкаНДС,"СтавкаНДС")= Неопределено тогда    //без ндс
				Об.БТ_СтатусСЧФ = Строка("Не требуется");  
			иначе
				Об.БТ_СтатусСЧФ= Строка("Нет счет-фактуры");
			КонецЕсли;
		КОнецЕсли;
		Об.БТ_СуммаНДС = Строка(СтрПоступление.Ссылка.Товары.Итог("СуммаНДС"));  
		Об.Записать();
	КонецЦикла;
	
КонецПроцедуры

//ЧалапАЮ БизТех 11.09.2024    - версионирование
Процедура БТ_верс_ЧисткаИсторииОбъектов()   экспорт
	#Область верс_ВерсииОбъектов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	верс_ВерсииОбъектов.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.верс_ВерсииОбъектов КАК верс_ВерсииОбъектов
	|ГДЕ
	//|	верс_ВерсииОбъектов.Объект.ПометкаУдаления
	|	ТИПЗНАЧЕНИЯ(верс_ВерсииОбъектов.Объект) В (&ТипыДокументов)
	|	И верс_ВерсииОбъектов.ДатаВерсии МЕЖДУ &ДатаНач И &ДатаКон"; 
	Запрос.УстановитьПараметр("ТипыДокументов", Документы.ТипВсеСсылки().Типы()); 
	Запрос.УстановитьПараметр("Датанач", ДобавитьМесяц(ТекущаяДата(),-6));    
	Запрос.УстановитьПараметр("Датакон", КОнецДня(Текущаядата()));

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл              
		Сообщить(ВыборкаДетальныеЗаписи.Объект);
		Набор = РегистрыСведений.верс_ВерсииОбъектов.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(ВыборкаДетальныеЗаписи.Объект); 
		Набор.Записать();
	КонецЦикла;
	#КонецОбласти
КонецПроцедуры

//++СнимченкоАА_бизтех++
Процедура БТ_АвтоматическоеСнятиеРезервов() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаявкаНаРемонт");
	СтруктураПараметров.Вставить("ФормированиеНапоминаний",Ложь);
	СтруктураПараметров.Вставить("СписаниеРезервовСПредоплатой",Ложь);
	Обработки.БТ_АвтоматическоеСнятиеРезервов.ВыполнитьАвтоматическоеСнятиеРезервов(СтруктураПараметров);
	
КонецПроцедуры 
//--СнимченкоАА_бизтех--

Функция ОбновитьПодписьОплачен(ЭтотОбъект) экспорт   //ЧалапАю БизТех 21.03.2025 000000802
	ЭМ_ПодписалОплату = обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_ПодписалОплату, Справочники.Пользователи.ПустаяСсылка());  
	ЭМ_ДатаУстановки = обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_ДатаУстановки, Дата(1,1,1)); 
	ЭМ_ДатаУстановкиСтрока = Формат(ЭМ_ДатаУстановки,"ДФ=dd.MM.yyyy");
	ЭМ_КнопкаНажата = обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_КнопкаНажата, ложь);    
	
	//пока подпись не выводим
	Если ЗначениеЗаполнено(ЭМ_ПодписалОплату) тогда //и не ЭМ_КнопкаНажата тогда
		Возврат ?(ЭМ_КнопкаНажата ,"Подписал оплату ","Снял подпись ") + ЭМ_ПодписалОплату+" "+ЭМ_ДатаУстановкиСтрока;
	КонецЕсли;       
	Возврат "";
КонецФункции

//ЧалапАЮ БизТех 21.03.2025  000000802
Функция НайтиПолнуюСтоимостьАвто(ДКП, Автомобиль,Реализация)     экспорт
	
	ПолнаяСтоимость = Новый Структура;
	
	//ТРЕЙД
	//может быть сдано несколько автомобилей
	//а если было изменение автомобиля - как они щас делают? -0 то есть ссылка зНА меняется
	ЗапросТрейд = Новый Запрос("ВЫБРАТЬ
								|	ЗначенияСвойствОбъектов.Объект КАК Поступление,
								|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
								|	СУММА(ЕСТЬNULL(ПоступлениеАвтомобилейАвтомобили.СуммаВсего, 0)) КАК СуммаВсего
								|ИЗ
								|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
								|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
								|		ПО ЗначенияСвойствОбъектов.Объект = ПоступлениеАвтомобилейАвтомобили.Ссылка
								|ГДЕ
								|	ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
								|	И ЗначенияСвойствОбъектов.Свойство = &Свойство
								|	И ЗначенияСвойствОбъектов.Значение = &Значение
								|
								|СГРУППИРОВАТЬ ПО
								|	ЗначенияСвойствОбъектов.Объект,
								|	ПоступлениеАвтомобилейАвтомобили.Автомобиль");
	ЗапросТрейд.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
	ЗапросТрейд.УстановитьПараметр("Значение",Реализация.ДокументОснование);
	РезультатТрейд=ЗапросТрейд.Выполнить().Выгрузить();    
	
	Если РезультатТрейд.Количество() тогда
		//СуммаТрейд = РезультатТрейд.Итог("СуммаВсего");     
		ПолнаяСтоимость.Вставить("СуммаТрейд", РезультатТрейд.Итог("СуммаВсего"));   
	иначе
		ПолнаяСтоимость.Вставить("СуммаТрейд",0);
    КонецЕсли;
	
	//КРЕДИТ
	//РЛ кредита подвязан к ЗНА	
	ЗапросКредит = Новый Запрос( "ВЫБРАТЬ
	                             |	РабочийЛистКредитногоОтдела.Ссылка КАК Ссылка,
	                             |	СУММА(РабочийЛистКредитногоОтдела.СуммаКредита) КАК СуммаКредита
	                             |ИЗ
	                             |	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
	                             |ГДЕ
	                             |	РабочийЛистКредитногоОтдела.Автомобиль = &Автомобиль
	                             |	И РабочийЛистКредитногоОтдела.ДокументОснование = &ДокументОснование
	                             |	И РабочийЛистКредитногоОтдела.Проведен
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	РабочийЛистКредитногоОтдела.Ссылка");
	
	ЗапросКредит.УстановитьПараметр("ДокументОснование",Реализация.ДокументОснование); 
	ЗапросКредит.УстановитьПараметр("Автомобиль",Автомобиль);
	
	РезультатКредит=ЗапросКредит.Выполнить().Выгрузить();  
	Если РезультатКредит.Количество() тогда
		//СуммаКСО = РезультатКредит.Итог("СуммаКредита");  
		ПолнаяСтоимость.Вставить("СуммаКСО", РезультатКредит.Итог("СуммаКредита"))
	иначе
		ПолнаяСтоимость.Вставить("СуммаКСО",0)
    КонецЕсли;
	
	
	//НАЛИЧНЫЕ
	СтруктураОтбора=Новый Структура();
	СтруктураОтбора.Вставить("Контрагент",            Реализация.Контрагент);
	СтруктураОтбора.Вставить("ДоговорВзаиморасчетов", Реализация.ДоговорВзаиморасчетов);
	ЗапросНаличные = Новый Запрос( "ВЫБРАТЬ
	                               |	ВзаиморасчетыКомпании.ХозОперация КАК ХозОперация,
	                               |	ВзаиморасчетыКомпании.Контрагент КАК Контрагент,
	                               |	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                               |	ВзаиморасчетыКомпании.Сумма КАК Сумма
	                               |ИЗ
	                               |	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	                               |ГДЕ
	                               |	ВзаиморасчетыКомпании.Контрагент = &Контрагент
	                               |	И ВзаиморасчетыКомпании.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
	                               |	И ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход)
	                               |	И (ВзаиморасчетыКомпании.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПриходныйКассовыйОрдер)
	                               |			ИЛИ ВзаиморасчетыКомпании.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплату))");
	
	ЗапросНаличные.УстановитьПараметр("Контрагент",Реализация.Контрагент);
	ЗапросНаличные.УстановитьПараметр("ДоговорВзаиморасчетов",Реализация.ДоговорВзаиморасчетов);
    РезультатНаличные = ЗапросНаличные.Выполнить().Выгрузить();
	Если   РезультатНаличные.Количество() тогда
		СуммаНаличные =  РезультатНаличные.Итог("Сумма");  
		ПолнаяСтоимость.Вставить("СуммаНаличные", РезультатНаличные.Итог("Сумма"))  
	иначе       
		СуммаНаличные = 0;
		ПолнаяСтоимость.Вставить("СуммаНаличные",0)
	КонецЕсли;
	
	
	//БЕЗНАЛ
	СтруктураОтбора=Новый Структура();
	СтруктураОтбора.Вставить("Контрагент",            Реализация.Контрагент);
	СтруктураОтбора.Вставить("ДоговорВзаиморасчетов", Реализация.ДоговорВзаиморасчетов);
	ЗапросБезнал = Новый Запрос( "ВЫБРАТЬ
	                             |	ВзаиморасчетыКомпании.ХозОперация КАК ХозОперация,
	                             |	ВзаиморасчетыКомпании.Контрагент КАК Контрагент,
	                             |	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                             |	ВзаиморасчетыКомпании.Сумма КАК Сумма
	                             |ИЗ
	                             |	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	                             |ГДЕ
	                             |	ВзаиморасчетыКомпании.Контрагент = &Контрагент
	                             |	И ВзаиморасчетыКомпании.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
	                             |	И ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход)
	                             |	И ТИПЗНАЧЕНИЯ(ВзаиморасчетыКомпании.Регистратор) = ТИП(Документ.Выписка)");
	
	ЗапросБезнал.УстановитьПараметр("Контрагент",Реализация.Контрагент);
	ЗапросБезнал.УстановитьПараметр("ДоговорВзаиморасчетов",Реализация.ДоговорВзаиморасчетов);
    РезультатБезнал = ЗапросБезнал.Выполнить().Выгрузить();
	Если   РезультатБезнал.Количество() тогда
		//СуммаБезнал = РезультатБезнал.Итог("Сумма") - СуммаНаличные;  
		ПолнаяСтоимость.Вставить("СуммаБезнал", РезультатБезнал.Итог("Сумма"))
	иначе
		ПолнаяСтоимость.Вставить("СуммаБезнал",0)
	КонецЕсли;
	Возврат ПолнаяСтоимость;
КонецФункции
